senserf/picos/PicOS/CC13XX/SAVED/rfprop_partial.c
/*
	Copyright 2002-2020 (C) Olsonet Communications Corporation
	Programmed by Pawel Gburzynski & Wlodek Olesinski
	All rights reserved

	This file is part of the PICOS platform

*/

// ============================================================================
// CC1350 RF driver operating in the so-called proprietary mode ===============
// ============================================================================

// Needed by some library includes
#define	DEVICE_FAMILY	cc13x0

#include <driverlib/rf_common_cmd.h>
#include <driverlib/rf_prop_cmd.h>
#include <driverlib/rf_prop_mailbox.h>
#include <driverlib/rf_data_entry.h>
#include <driverlib/rfc.h>
#include <inc/hw_rfc_rat.h>

// ============================================================================
// Notes and issues:
// ============================================================================
//
// Check if using RF memory allows us to lower the power budget. This is tricky
// because we have to circumvent the patch area.
//
// How can we prevent interrupting reception in progress by a transmission?
// We can have reception with a timeout while waiting for sync, which should do
// for synchronized acks (and stuff like that). I don't think we can detect
// reception and postpone transmission any other way.
//
// Cold-starting up the transmitter takes 5ms; check the reference code again
// Can we do better?
//
// ============================================================================

#if 1
#define	TIME_COLDSTART		do { \
		GPIO_setOutputEnableDio (IOID_29, GPIO_OUTPUT_ENABLE); \
		GPIO_clearDio (IOID_29); \
	} while (0)
#define	TIME_COLDSTART_ON	GPIO_setDio (IOID_29)
#define	TIME_COLDSTART_OFF	GPIO_clearDio (IOID_29)
#else
#define	TIME_COLDSTART		CNOP
#define	TIME_COLDSTART_ON	CNOP
#define	TIME_COLDSTART_OFF	CNOP
#endif

// ============================================================================

#define	WOR_SETTLING_DELAY	10

// The RAT clock rate is 4MHz
#define	RAT_TICKS_PER_US		4

// TX command header size (shared by TX and ADV)
#define	TX_ADV_HEADER_SIZE		14

// This determines the length of the correlation period for WOR by being added
// to the sync word length (taken from the example)
#define CORR_PERIOD_SYM_MARGIN		16

// The parameters of the preamble check interval in us for WOR.
// I took it from the example, but it probably can be adjusted in principle.
// This is what the example says:
// ==============================
// csEndTimeUs = (CS_END_TIME_MIN_TIME_SYM * symbolLengthUs +
// 					CS_END_TIME_MIN_TIME_STATIC_US);
// Represents the time where we will force a check if preamble is present (only
// done once). The main idea is that this should be shorter than
// "correlationPeriodUs" (corrPeriod) so that if we get RSSI valid, but there
// is not a valid preamble on the air, we will leave RX as quickly as possible.
//
#define CS_END_TIME_MIN_TIME_SYM	30
#define CS_END_TIME_MIN_TIME_STATIC_US	150
// The second (static) parameter is for rate <= 200 kbps, it is 200 <= 400 kbps
// and 250 for 500 kbps

// Margin to add to the WOR preamble time + syncword to calculate the maximum
// time from the start trigger to when we expect a sync word to be received 
// (from the example).
#define RX_END_TIME_SYM_MARGIN		8

// WOR interval adjustment: RAT ticks to subtract from the calculated period.
// In the example, it is 0.005 of one second expressed as the number of RAT
// ticks (WOR_WAKE_UP_MARGIN_S defined as 0.005f). I prefer to have it in
// us.
#define	WOR_INTERVAL_ADJUSTMENT_US	5000

#include <rf_patches/rf_patch_cpe_genfsk.h>
#include <rf_patches/rf_patch_rfe_genfsk.h>

#include "sysio.h"
#include "tcvphys.h"
#include "cc1350.h"

// Radio parameter settings by TI
#define	mkmk_eval
#include "smartrf_settings.h"
#undef	mkmk_eval

#define	DETECT_HANGUPS	100

// ============================================================================

static	int paylen = 0;			// Current TX payload length

static byte	rbuffl = 0,		// Input buffer length
		dstate = 0;		// Driver state

#if RADIO_LBT_SENSE_TIME > 0
static byte	txtries = 0;		// Number of TX attempts for current pkt
#endif

#if RADIO_LBT_MAX_TRIES > 255
#undef	RADIO_LBT_MAX_TRIES
#define	RADIO_LBT_MAX_TRIES	255
#endif

// State flags
#define	DSTATE_RXON	0x01	// Rx formally turned on
#define	DSTATE_RXAC	0x02	// Rx physically active
#define	DSTATE_TXIP	0x04	// Tx in progress
#define	DSTATE_WORN	0x08	// WOR formally turned on
#define	DSTATE_RFON	0x10	// Device physically on
#define	DSTATE_WORA	0x20	// WOR active
#define	DSTATE_WORS	0x40	// WOR suspended after a packet reception
#define	DSTATE_IRST	0x80	// Reset request

// WOR requested and not suspended
#define	dstate_wor_rq	((dstate & (DSTATE_WORN | DSTATE_WORS)) == DSTATE_WORN)

// WOR requested but suspended
#define	dstate_wor_su	((dstate & (DSTATE_WORN | DSTATE_WORS)) == \
				(DSTATE_WORN | DSTATE_WORS))

// The number of simultaneous receive buffers
#define	NRBUFFS		2

// The secret (undocumented) command (stolen from tirtos)
#define	RF_CMD0		0x0607

static byte	vrate = RADIO_BITRATE_INDEX,
		channel = RADIO_DEFAULT_CHANNEL;

#if RADIO_DEFAULT_POWER <= 7
// ============================================================================
// Power can be changed; the max power must be hardwired (with rate 0) for
// long range operation
// ============================================================================

static byte txpower;

// Used to be const, but we want to be able to modify the values from the
// default settings and also be able to revert to the defaults
static word patable_def [] = CC1350_PATABLE;	// Default power settings
static address patable = patable_def;		// Effective settings

#endif

static word	physid,
		statid = 0,
		bckf_timer = 0;

#if RADIO_WOR_MODE
// ============================================================================
// Need extra commands for sniffing (receiving) in WOR mode, as well as
// transmitting with settable long preambles (so-called ADVertisement
// packets)
// ============================================================================

static rfc_CMD_PROP_RX_SNIFF_t cmd_sn;

// Command for transmitting long-preamble wake-up packets. The functionality
// (I mean WOR RX and WOR TX) should probably by split into separate options
// because it is unlikely that a single node type will need them both.
static rfc_CMD_PROP_TX_ADV_t cmd_ta;

