senserf/picos/PicOS/CC13XX/SAVED/rfprop_partial.c
static int rx_int_enable () {

	rfc_dataEntryGeneral_t *db;
	int i, pl, nr;

	// This clears all interrupt flags and enables those that we want; this
	// is different than (e.g.) in CC1100/MSP430, because events can be
	// lost (the clear operation may remove an event that we haven't looked
	// at yet); so we do the reception with interrupts enabled; if an
	// interrupt arrives while we are looking, it will just unblock the
	// driver thread which will force (later) another invocation of this
	// function. But it is important to always make sure that when the
	// function is being invoked, the driver thread is already waiting for
	// qevent.

	enable_event (qevent);

#define	__dp	(&(db->data))
#define	__pk	((address)(__dp + 2))
#define	__ni	(__pk [0])

	// Receive
	for (db = (rfc_dataEntryGeneral_t*) (rbuffs->pCurrEntry), i = nr = 0;
	    i < NRBUFFS; i++, db = (rfc_dataEntryGeneral_t*)(db->pNextEntry)) {
		if (db->status == DATA_ENTRY_FINISHED) {
			LEDI (2, 1);

			// Consistency checks
			if (
				// Physical length matches logical length ...
				     __dp [0] == __dp [1] + 3 
				// ... and the packet fits into RX buffer ...
				  && __dp [1] <= rbuffl
				// ... and it has at least 2 bytes of payload
				// and the payload length is even ...
			    	  && __dp [1] >= 2 && (__dp [1] & 1) == 0
				// ... and the NetId check passes which means
				// that:
#if 1
				  && (
					// the NetIds are same ...
					     __ni == statid
					// ... or the packet is global ...
					  || __ni == 0
					// ... or we are promiscuous
					  || statid == 0 || statid == 0xffff
				  )
#endif
			    ) {
				// Packet length plus two extra bytes at the
				// end
				pl = __dp [1] + 2;
				// Swap RSS and status, actually move RSS one
				// byte up and zero the status (for now); RSS
				// is unbiased to nonnegative (as per usual)
				add_entropy (__dp [pl]);
				__dp [pl + 1] = __dp [pl] + 128;
				__dp [pl] = 0;
				nr++;
				tcvphy_rcv (physid, __pk, pl);
			}
#ifdef	DETECT_HANGUPS
			else {
				diag ("BAD RX");
			}
#endif
			// Mark the buffer as free
			db->status = DATA_ENTRY_PENDING;
		}
	}

#undef __dp
#undef __pk
#undef __ni

#if RADIO_WOR_MODE
	if (dstate & DSTATE_WORA) {
		if (nr) {
			// Reception while WOR is active
			if (params . offdelay) {
				// Deactivate WOR for the prescribed interval
				_BIS (dstate, DSTATE_WORS);
				LEDI (2, 0);
				return YES;
			}
		}

		// Issue the next command
		cmd_sn . startTime += wor_wakeup_interval;
		issue_cmd ((lword)&cmd_sn);
	}
#endif

	if (nr) {
		gbackoff_rcv;
	}

	LEDI (2, 0);
	// State OK
	return NO;
}

void RFCCPE0IntHandler (void) {
//
// Any interrupt (of the enabled kind) just unhangs the driver thread
//
	if (HWREG (RFC_DBELL_BASE + RFC_DBELL_O_RFCPEIFG) &
	    RFC_DBELL_RFCPEIFG_INTERNAL_ERROR)
		// Internal error
		_BIS (dstate, DSTATE_IRST);


	// Clear all interrupts (why do they do it in a loop?); must be some
	// magic, because it didn't work for me the sane way
	RFCCpeIntClear (LWNONE);
	// HWREG (RFC_DBELL_BASE + RFC_DBELL_O_RFCPEIFG) = 0;
	// Disable
	RFCCpeIntDisable (LWNONE);
	// HWREG (RFC_DBELL_BASE + RFC_DBELL_O_RFCPEIEN) = 0;

	if (to_trigger) {
		p_trigger (drvprcs, to_trigger);
		// Only once ?
		to_trigger = 0;
	}

	RISE_N_SHINE;
}

// ============================================================================

#define	DR_LOOP		0
#define	DR_XMIT		1
#define	DR_FRCE		2
#define	DR_FXMT		3
#define	DR_GOOF		4
#define	DR_WRES		5
#define	DR_WURG		6
#define	DR_WXMT		7

#define	the_packet 		(RF_cmdPropTx.pPkt)
#define	the_packet_length 	(RF_cmdPropTx.pktLen)

#ifdef	DETECT_HANGUPS
static	lword txcounter;
#endif

thread (cc1350_driver)

#if (RADIO_OPTIONS & RADIO_OPTION_PXOPTIONS)
	address ppm;
	word pcav;
#endif
	entry (DR_LOOP)

		// We come here for anything that happens; dstate tells us
		// where we are statewise:
		//
		// RXON = we want RX to be on (modified by PHYSOPT only)
		// WORN = we want WOR to be on (same)
		// WORS = WOR is suspended (with WORN, implies !WORA)
		// RFON = the device is on
		// RXAC	= RX active (including WOR)
		// WORA = WOR active (with RXAC), implies !WORS
		// IRST = reset requested
		// TXIP = packet being transmitted
DR_LOOP__:
		// Make sure the packet is unlocked whenever we get here; it
		// is definitely not being transmitted
		_BIC (dstate, DSTATE_TXIP);
		
		// Reset request is easy; make sure this is the only place
		// where reset is actually handled (and the flag is cleared)
		if (dstate & DSTATE_IRST) {
			// Remove the flag
			_BIC (dstate, DSTATE_IRST);
			// Turn the device off; this will clear: RFON, RXAC,
			// WORA
			rf_off ();
			// Things should get back to where they were in the
			// following sequence
		}

		if (dstate & DSTATE_RXON) {
			// The RX is ON, this also covers WOR
#if RADIO_WOR_MODE
			if ((dstate & DSTATE_RXAC) == 0) {
				// RX must be activated, rx_ac looks at the
				// WOR options
RxOn:
				rx_ac ();
				if (dstate & DSTATE_WORA) {
					// Apply a settling delay, the sniff
					// command tends to hang without it.
					// It seems to be needed following
					// ON and preceding the command issue.
					delay (WOR_SETTLING_DELAY, DR_LOOP);
					release;
				}
			} else if (dstate & DSTATE_WORA) {
				// RX is active and WOR is active ...
				if (!dstate_wor_rq) {
					// ... but WOR is not asked for, stop
					// RX and do it again, so rx_ac can
					// set the state right;
					// note that dstate_wor_rq accounts for
					// WOR being possibly suspended
WorOn:
					rx_de ();
					goto RxOn;
				}
				// We are good otherwise
			} else {
				// RX is active and WOR is inactive ...
				if (dstate_wor_rq)
					// ... but WOR is needed, exactly like
					// previous case
					goto WorOn;
			}
#else	/* NO WOR */
			if ((dstate & DSTATE_RXAC) == 0) {
				// Without WOR, we just care about the RX state
				rx_ac ();
			}
#endif	/* WOR / NO WOR */
		} else {
			// RX is meant to be off, make sure it is
			rx_de ();
		}

		// We have gotten the state right, see if there is a packet
		// to transmit
		if (paylen == 0) {
			// We have to look at the queue. If paylen != 0, it
			// means that we have a previous packet (already
			// extracted from the queue)
			if ((the_packet = (byte*)tcvphy_get (physid, &paylen))
			    != NULL) {
				// Ignore the two extra bytes right away, we
				// have no use for them
				paylen -= 2;
				sysassert (paylen <= rbuffl && paylen > 0 &&
				    (paylen & 1) == 0, "cc13 py");

				LEDI (1, 1);

				if (statid != 0xffff)
					// Insert NetId
					((address)the_packet) [0] = statid;

				// Plug it into the command
				the_packet_length = (byte) paylen;
			}
		}

		if (paylen == 0) {
			// If paylen is still zero, there is nothing to
			// transmit at the moment
			wait (qevent, DR_LOOP);
			if (dstate & DSTATE_RXAC) {
				// Try to receive; this also covers the
				// response to a WOR event. Note that we have
				// to issue wait before this operation because
				// of the interrupt race
				if (rx_int_enable ())
					// WORS has been set, reset the RX
					goto DR_LOOP__;
				// For lost interrupts (test)
				// delay (1024, DR_LOOP);
#if RADIO_WOR_MODE
				if (dstate_wor_su)
					// WOR active but suspended; wait for
					// offdelay and, if nothing happens,
					// unsuspend WOR. While WOR is
					// suspended, we operate in the normal
					// full-power receive mode
					delay (params . offdelay, DR_WRES);
#endif
			} else if (dstate & DSTATE_RFON) {
				// Nothing to transmit and the receiver is OFF,
				// turn the radio off after a delay. Note that
				// we don't do this if WOR is on (RXAC is then
				// on, too)
				delay (params . offdelay, DR_GOOF);
			}
			// Do nothing until something happens
			release;
		}

#if RADIO_WOR_MODE

		// If the packet is urgent, we treat it as a WOR wakeup packet.
		// Unfortunately, we have to preprocess it a bit because the
		// ADV TX format (needed to issue a long preamble) does not
		// accept the automatic length byte, which means that we have
		// to push the packet into a separate buffer

